frontend/controllers/AuthorsController.php

    protected function findModel($id)
    {
        if (($model = Authors::findOne($id)) !== null) {
---
SELECT * FROM `authors` WHERE `author_id`='1'