frontend/controllers/BooksController.php

SELECT * FROM `authors`
---
    public function actionCreate()
    {
        $model = new Books();

        if ($model->load(Yii::$app->request->post())) {
            $postDetails = Yii::$app->request->post();
            $author_id = isset($postDetails['Books']['author_id']) ? $postDetails['Books']['author_id'] : null;
            $model->author_id = $author_id;
            $model->created_at = date("Y-m-d H:i:s");
            $model->save();
            return $this->redirect(['index']);
        } else {
            $authorList = Authors::find()->all();

SELECT * FROM `books` WHERE `book_id`='1'
---
    protected function findModel($id)
    {
        if (($model = Books::findOne($id)) !== null) {