frontend/controllers/LibrariesController.php

    public function actionView($id)
    {
        $authorList = Authors::find()->all();
---
SELECT * FROM `authors`

    protected function findModel($id)
    {
        if (($model = Libraries::findOne($id)) !== null) {
---
SELECT * FROM `libraries` WHERE `id`='3'