frontend/models/Libraries.php

    public function getBookList()
    {
        $data = Books::find()->where(['library_id' => null])->all();
---
SELECT * FROM `books` WHERE `library_id` IS NULL